{
  "races": [
    {
      "id": "Human",
      "racial traits": {
        "abscore": "+1 to All Ability Scores"
      },
      "description": {
        "info": "Humans are the most adaptable and ambitious people among the common races. Whatever drives them, humans are the innovators, the achievers, and the pioneers of the worlds.",
        "abScInc": "Your ability scores each increase by 1.",
        "age": "Humans reach adulthood in their late teens and live less than a century.",
        "alignment": "Humans tend toward no particular alignment. The best and the worst are found among them.",
        "size": "Humans vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium.",
        "speed": "Your base walking speed is 30 feet.",
        "languages": "You can speak, read, and write Common and one extra language of your choice. Humans typically learn the languages of other peoples they deal with, including obscure dialects. They are fond of sprinkling their speech with words borrowed from other tongues: Orc curses, Elvish musical expressions, Dwarvish military phrases, and so on."
      }
    },
    {
      "id": "Elf",
      "racial traits": {
        "abscore": "+2 Dexterity",
        "skills": [
          "Darkvision",
          "Keen Senses",
          "Fey Ancestry",
          "Trance"
        ]
      },
      "description": {
        "info": "Elves are a magical people of otherworldly grace, living in the world but not entirely part of it.",
        "abScInc": "Your Dexterity score increases by 2.",
        "age": "Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. An elf typically claims adulthood and an adult name around the age of 100 and can live to be 750 years old.",
        "alignment": "Elves love freedom, variety, and self-expression, so they lean strongly toward the gentler aspects of chaos. They value and protect others’ freedom as well as their own, and they are more often good than not. The drow are an exception; their exile into the Underdark has made them vicious and dangerous. Drow are more often evil than not.",
        "size": "Elves range from under 5 to over 6 feet tall and have slender builds. Your size is Medium.",
        "speed": "Your base walking speed is 30 feet.",
        "languages": "You can speak, read, and write Common and Elvish. Elvish is fluid, with subtle intonations and intricate grammar. Elven literature is rich and varied, and their songs and poems are famous among other races. Many bards learn their language so they can add Elvish ballads to their repertoires."
      }
    },
    {
      "id": "Halfling",
      "racial traits": {
        "abscore": "+2 Dexterity",
        "skills": [
          "Lucky",
          "Brave",
          "Halfling Nimbenes"
        ]
      },
      "description": {
        "info": "The diminutive halflings survive in a world full of larger creatures by avoiding notice or, barring that, avoiding offense.",
        "abScInc": "Your Dexterity score increases by 2.",
        "age": "A halfling reaches adulthood at the age of 20 and generally lives into the middle of his or her second century.",
        "alignment": "Most halflings are lawful good. As a rule, they are good-hearted and kind, hate to see others in pain, and have no tolerance for oppression. They are also very orderly and traditional, leaning heavily on the support of their community and the comfort of their old ways.",
        "size": "Halflings average about 3 feet tall and weigh about 40 pounds. Your size is Small.",
        "speed": "Your base walking speed is 25 feet.",
        "languages": "You can speak, read, and write Common and Halfling. The Halfling language isn’t secret, but halflings are loath to share it with others. They write very little, so they don’t have a rich body of literature. Their oral tradition, however, is very strong. Almost all halflings speak Common to converse with the people in whose lands they dwell or through which they are traveling."
      }
    },
    {
      "id": "Dwarf",
      "racial traits": {
        "abscore": "+2 Constitution",
        "skills": [
          "Darkvision",
          "Dwarven Resilience",
          "Dwarven Combat Training",
          "Stonecunning"
        ]
      },
      "description": {
        "info": "Bold and hardy, dwarves are known as skilled warriors, miners, and workers of stone and metal.",
        "abScInc": "Your Constitution score increases by 2.",
        "age": "Dwarves mature at the same rate as humans, but they’re considered young until they reach the age of 50. On average, they live about 350 years.",
        "alignment": "Most dwarves are lawful, believing firmly in the benefits of a well-ordered society. They tend toward good as well, with a strong sense of fair play and a belief that everyone deserves to share in the benefits of a just order.",
        "size": "Dwarves stand between 4 and 5 feet tall and average about 150 pounds. Your size is Medium.",
        "speed": "Your base walking speed is 25 feet. Your speed is not reduced by wearing heavy armor.",
        "languages": "You can speak, read, and write Common and Dwarvish. Dwarvish is full of hard consonants and guttural sounds, and those characteristics spill over into whatever other language a dwarf might speak."
      }
    }
  ],
  "classes": [
    {
      "id": "Fighter",
      "class features": {
        "hitDie": "d10",
        "primAbil": "Strength or Dexterity",
        "saves": "Strength + Constitution"
      },
      "description": {
        "info": "A master of martial combat, skilled with a variety of weapons and armor",
        "hitDice": "1d10 per fighter level",
        "hitAtFirstLvl": "10 + your Constitution modifier",
        "hitAtHigherLvl": "1d10 (or 6) + your Constitution modifier per fighter level after 1st",
        "profArmor": "All armor, shields",
        "profWeapons": "Simple weapons, martial weapons",
        "profTool": "None",
        "savingThrow": "Strength, Constitution",
        "skills": "Choose two skills from Acrobatics, Animal Handling, Athletics, History, Insight, Intimidation, Perception, and Survival",
        "fightStyle": "You adopt a particular style of fighting as your specialty. Choose one of the following options. You can’t take a Fighting Style option more than once, even if you later get to choose again.",
        "secondWind": "You have a limited well of stamina that you can draw on to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to 1d10 + your fighter level. Once you use this feature, you must finish a short or long rest before you can use it again."
      }
    },
    {
      "id": "Ranger",
      "class features": {
        "hitDie": "d10",
        "primAbil": "Dexterity or Wisdom",
        "saves": "Strength + Dexterity"
      },
      "description": {
        "info": "A warrior who combats threats on the edges of civilization",
        "hitDice": "1d10 per ranger level",
        "hitAtFirstLvl": "10 + your Constitution modifier",
        "hitAtHigherLvl": "1d10 (or 6) + your Constitution modifier per ranger level after 1st",
        "profArmor": "Light armor, medium armor, shields",
        "profWeapons": "Simple weapons, martial weapons",
        "profTool": "None",
        "savingThrow": "Strength, Dexterity",
        "skills": "Choose three from Animal Handling, Athletics, Insight, Investigation, Nature, Perception, Stealth, and Survival",
        "favoredEnemy": "Beginning at 1st level, you have significant experience studying, tracking, hunting, and even talking to a certain type of enemy.",
        "naturalExplorer": "You are particularly familiar with one type of natural environment and are adept at traveling and surviving in such regions."
      }
    },
    {
      "id": "Rogue",
      "class features": {
        "hitDie": "d8",
        "primAbil": "Dexterity",
        "saves": "Dexterity & Intelligence"
      },
      "description": {
        "info": "A scoundrel who uses stealth and trickery to overcome obstacles and enemies",
        "hitDice": "1d8 per rogue level",
        "hitAtFirstLvl": "8 + your Constitution modifier",
        "hitAtHigherLvl": "1d8 (or 5) + your Constitution modifier per rogue level after 1st",
        "profArmor": "Light armor",
        "profWeapons": "Simple weapons, hand crossbows, longswords, rapiers, shortswords",
        "profTool": "Thieves’ tools",
        "savingThrow": "Dexterity, Intelligence",
        "skills": "Choose four from Acrobatics, Athletics, Deception, Insight, Intimidation, Investigation, Perception, Performance, Persuasion, Sleight of Hand, and Stealth",
        "expertise": "At 1st level, choose two of your skill proficiencies, or one of your skill proficiencies and your proficiency with thieves’ tools. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies.",
        "sneakAttack": "Beginning at 1st level, you know how to strike subtly and exploit a foe’s distraction. Once per turn, you can deal an extra 1d6 damage to one creature you hit with an attack if you have advantage on the attack roll. The attack must use a finesse or a ranged weapon. You don’t need advantage on the attack roll if another enemy of the target is within 5 feet of it, that enemy isn’t incapacitated, and you don’t have disadvantage on the attack roll. The amount of the extra damage increases as you gain levels in this class, as shown in the Sneak Attack column of the Rogue table.",
        "thiefCant": "During your rogue training you learned thieves’ cant, a secret mix of dialect, jargon, and code that allows you to hide messages in seemingly normal conversation. Only another creature that knows thieves’ cant understands such messages. It takes four times longer to convey such a message than it does to speak the same idea plainly. In addition, you understand a set of secret signs and symbols used to convey short, simple messages, such as whether an area is dangerous or the territory of a thieves’ guild, whether loot is nearby, or whether the people in an area are easy marks or will provide a safe house for thieves on the run."
      }
    },
    {
      "id": "Sorcerer",
      "class features": {
        "hitDie": "d6",
        "primAbil": "Charisma",
        "saves": "Constitution & Charisma"
      },
      "description": {
        "info": "A spellcaster who draws on inherent magic from a gift or bloodline",
        "hitDice": "1d6 per sorcerer level",
        "hitAtFirstLvl": "6 + your Constitution modifier",
        "hitAtHigherLvl": "1d6 (or 4) + your Constitution modifier per sorcerer level after 1st",
        "profArmor": "None",
        "profWeapons": "Daggers, darts, slings, quarterstaffs, light crossbows",
        "profTool": "None",
        "savingThrow": "Constitution, Charisma",
        "skills": "Choose two from Arcana, Deception, Insight, Intimidation, Persuasion, and Religion",
        "spellInfo": "An event in your past, or in the life of a parent or ancestor, left an indelible mark on you, infusing you with arcane magic. This font of magic, whatever its origin, fuels your spells.",
        "cantrips": "At 1st level, you know four cantrips of your choice from the sorcerer spell list. You learn additional sorcerer cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Sorcerer table.",
        "spellSlots": "The Sorcerer table shows how many spell slots you have to cast your sorcerer spells of 1st level and higher. To cast one of these sorcerer spells, you must expend a slot of the spell’s level or higher. You regain all expended spell slots when you finish a long rest.",
        "spellSaveDc": "8 + your proficiency bonus + your Charisma modifier",
        "spellAttackMod": "your proficiency bonus + your Charisma modifier"
      }
    }
  ],
  "background": [
    {
      "id": "Acolyte",
      "description": {
        "info": "You have spent your life in the service of a temple to a specific god or pantheon of gods. You act as an intermediary between the realm of the holy and the mortal world, performing sacred rites and offering sacrifices in order to conduct worshipers into the presence of the divine. You are not necessarily a cleric—performing sacred rites is not the same thing as channeling divine power.",
        "skillProff": [
          "Insight",
          "Religion"
        ],
        "backFeature": "Shelter Of The Faithful",
        "featureInfo": "As an acolyte, you command the respect of those who share your faith, and you can perform the religious ceremonies of your deity. You and your adventuring companions can expect to receive free healing and care at a temple, shrine, or other established presence of your faith, though you must provide any material components needed for spells. Those who share your religion will support you (but only you) at a modest lifestyle.You might also have ties to a specific temple dedicated to your chosen deity or pantheon, and you have a residence there. This could be the temple where you used to serve, if you remain on good terms with it, or a temple where you have found a new home. While near your temple, you can call upon the priests for assistance, provided the assistance you ask for is not hazardous and you remain in good standing with your temple."
      }
    },
    {
      "id": "Criminal or Spy",
      "description": {
        "info": "You are an experienced criminal with a history of breaking the law. You have spent a lot of time among other criminals and still have contacts within the criminal underworld. You’re far closer than most people to the world of murder, theft, and violence that pervades the underbelly of civilization, and you have survived up to this point by flouting the rules and regulations of society.",
        "skillProff": [
          "Deception",
          "Stealth"
        ],
        "toolProff": "Thieves' Tools",
        "backFeature": "Criminal Contact",
        "featureInfo": "You have a reliable and trustworthy contact who acts as your liaison to a network of other criminals. You know how to get messages to and from your contact, even over great distances; specifically, you know the local messengers, corrupt caravan masters, and seedy sailors who can deliver messages for you."
      }
    },
    {
      "id": "Folk Hero",
      "description": {
        "info": "You come from a humble social rank, but you are destined for so much more. Already the people of your home village regard you as their champion, and your destiny calls you to stand against the tyrants and monsters that threaten the common folk everywhere.",
        "skillProff": [
          "Animal Handling",
          "Survival"
        ],
        "vehicleProff": "Vehicles (Land)",
        "backFeature": "Rustic Hospitality",
        "featureInfo": "Since you come from the ranks of the common folk, you fit in among them with ease. You can find a place to hide, rest, or recuperate among other commoners, unless you have shown yourself to be a danger to them. They will shield you from the law or anyone else searching for you, though they will not risk their lives for you."
      }
    },
    {
      "id": "Haunted One",
      "description": {
        "info": "You are haunted by something so terrible that you dare not speak of it. You’ve tried to bury it and run away from it, to no avail. Whatever this thing is that haunts you can’t be slain with a sword or banished with a spell. It might come to you as a shadow on the wall, a bloodcurdling nightmare, a memory that refuses to die, or a demonic whisper in the dark. The burden has taken its toll, isolating you from most people and making you question your sanity. You must find a way to overcome it before it destroys you.",
        "backFeature": "Heart of Darkness",
        "featureInfo": "Those who look into your eyes can see that you have faced unimaginable horror and that you are no stranger to darkness. Though they might fear you, commoners will extend you every courtesy and do their utmost to help you. Unless you have shown yourself to be a danger to them, they will even take up arms to fight alongside you, should you find yourself facing an enemy alone."
      }
    },
    {
      "id": "Sage",
      "description": {
        "info": "You spent years learning the lore of the multiverse. You scoured manuscripts, studied scrolls, and listened to the greatest experts on the subjects that interest you. Your efforts have made you a master in your fields of study.",
        "skillProff": [
          "Arcana",
          "History"
        ],
        "backFeature": "Researcher",
        "featureInfo": "When you attempt to learn or recall a piece of lore, if you do not know that information, you often know where and from whom you can obtain it. Usually, this information comes from a library, scriptorium, university, or a sage or other learned person or creature. Your DM might rule that the knowledge you seek is secreted away in an almost inaccessible place, or that it simply cannot be found. Unearthing the deepest secrets of the multiverse can require an adventure or even a whole campaign."
      }
    },
    {
      "id": "Soldier",
      "description": {
        "info": "War has been your life for as long as you care to remember. You trained as a youth, studied the use of weapons and armor, learned basic survival techniques, including how to stay alive on the battlefield. You might have been part of a standing national army or a mercenary company, or perhaps a member of a local militia who rose to prominence during a recent war.<br/>When you choose this background, work with your DM to determine which military organization you were a part of, how far through its ranks you progressed, and what kind of experiences you had during your military career. Was it a standing army, a town guard, or a village militia? Or it might have been a noble’s or merchant’s private army, or a mercenary company.",
        "skillProff": [
          "Athletics",
          "Intimidation"
        ],
        "vehicleProff": "Vehicles (Land)",
        "backFeature": "Military Rank",
        "featureInfo": "You have a military rank from your career as a soldier. Soldiers loyal to your former military organization still recognize your authority and influence, and they defer to you if they are of a lower rank. You can invoke your rank to exert influence over other soldiers and requisition simple equipment or horses for temporary use. You can also usually gain access to friendly military encampments and fortresses where your rank is recognized."
      }
    }
  ],
  "player": []
}